## pandas
If you cannot remember them all, try to google "pandas cheat sheet" and print it out!

In [1]:
#from pandas import Series, DataFrame
import pandas as pd

### Series

In [2]:
# Series
"""
A Series is a one-dimensional array-like object
containing an array of data (of any NumPy data type) and
an associated array of data labels, called its index.
"""

ser = pd.Series([1, 3, 5, 7])
print(type(ser))
print(ser)

<class 'pandas.core.series.Series'>
0    1
1    3
2    5
3    7
dtype: int64

In [3]:
print(ser.values)
print(ser.index)

[1 3 5 7]
RangeIndex(start=0, stop=4, step=1)

In [4]:
ser2 = pd.Series([1, 3, 5, 7], index = ['d', 'b', 'c', 'a'])
print(ser2)

d    1
b    3
c    5
a    7
dtype: int64

In [5]:
print(ser2['a'])
select = ['a', 'b', 'd']
print(ser2[select]) # shadow

7
a    7
b    3
d    1
dtype: int64

In [6]:
print(ser2[ser2 > 4])

c    5
a    7
dtype: int64

In [7]:
print(ser2 * 2)

d     2
b     6
c    10
a    14
dtype: int64

In [8]:
import numpy as np
print(np.exp(ser2))

d       2.718282
b      20.085537
c     148.413159
a    1096.633158
dtype: float64

In [9]:
print('b' in ser2) # in index, not value!!!

True

In [10]:
# From Python built-in dictionary to (labled) Series
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
ser3 = pd.Series(sdata)
print(ser3)

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [11]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
ser4 = pd.Series(sdata, index = states)
print(ser4)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [12]:
pd.isnull(ser4) # or ser4.isnull() and try ser4.notnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [13]:
print(ser3)
print(ser4)
print(ser3 + ser4)

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64
California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [14]:
# Name, you can name (the data of) a Series and name its index
ser4.name = "population"
ser4.index.name = "states"
print(ser4)

states
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

### DataFrame

In [15]:
# DataFrame
"""
A DataFrame represents a tabular, spreadsheet-like data structure
containing an ordered collection of columns.
The DataFrame has both a row and column index;
it can be thought of as a dict of Series.

Row-oriented and column-oriented operations in DataFrame
are treated roughly symmetrically.
Under the hood, the data is stored as one or more two-dimensional blocks
rather than a list, dict.
"""

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [16]:
df = pd.DataFrame(data, columns=['year', 'state', 'pop']) # sorted by columns
print(df)

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [17]:
df2 = pd.DataFrame(data,
                   columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
print(df2)

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [18]:
print(df2.year) # or df2['year']
print(df2['state']) # or df2.state

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64
one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [19]:
#print(df2.ix['two']) # ix is deprecated
print(df2.loc['two'])

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

In [20]:
df2.debt = 5. # try np.arange(5.)
print(df2)

       year   state  pop  debt
one    2000    Ohio  1.5   5.0
two    2001    Ohio  1.7   5.0
three  2002    Ohio  3.6   5.0
four   2001  Nevada  2.4   5.0
five   2002  Nevada  2.9   5.0

In [21]:
ser = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
df2['debt'] = ser
print(df2)

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [22]:
# dictionary-like
df2['eastern'] = (df2.state == 'Ohio')
print(df2)

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [23]:
df3 = df2.T
print(df3)

          one   two three    four    five
year     2000  2001  2002    2001    2002
state    Ohio  Ohio  Ohio  Nevada  Nevada
pop       1.5   1.7   3.6     2.4     2.9
debt      NaN  -1.2   NaN    -1.5    -1.7
eastern  True  True  True   False   False

In [24]:
# Index objects are immutable
print(df2.index)
try:
    df2.index[0] = "oneone"
except Exception as e:
    print(e)

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')
Index does not support mutable operations

### Reindexing

In [25]:
ser1 = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
ser2 = ser1.reindex(['a', 'b', 'c', 'd', 'e'])
print(ser2)

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [26]:
ser1.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [27]:
# For ordered data like time series, 
# it may be desirable to do some interpolation or
# filling of values when reindexing.

ser3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
ser4 = ser3.reindex(range(6), method='ffill') # ffill: fill (or carry) values forward; bfill: backward
print(ser3)
print(ser4)

0      blue
2    purple
4    yellow
dtype: object
0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [28]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
print(data)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [29]:
d = data.drop(['Colorado', 'Ohio']) # view
d

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [30]:
d = data.drop(['two', 'four'], axis = 1) # view
d

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [31]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [32]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [33]:
data.loc['Colorado', ['two', 'three']] # DataFrame has no data[vala, valb], please use 'loc[]'

two      5
three    6
Name: Colorado, dtype: int32

In [34]:
# +-*/ still work for DataFrame

In [35]:
frame = pd.DataFrame(np.random.randn(4, 3),
                     index = ['Utah', 'Ohio', 'Texas', 'Oregon'],
                     columns = list('abd'))
print(frame)

               a         b         d
Utah    1.542777  0.724400 -1.681519
Ohio   -1.710509 -0.329308 -0.888975
Texas   0.077745  0.447277 -0.680548
Oregon  1.373384 -1.586810  1.102097

In [36]:
f = lambda x: x.max() - x.min() # x should be a list-like data
frame.apply(f, axis = 0)

a    3.253285
b    2.311210
d    2.783617
dtype: float64

In [37]:
help(pd.DataFrame.apply) # see pd.DataFrame.apply and pd.DataFrame.applymap

Help on function apply in module pandas.core.frame:

apply(self, func, axis=0, broadcast=False, raw=False, reduce=None, args=(), **kwds)
    Applies function along input axis of DataFrame.

    Objects passed to functions are Series objects having index
    either the DataFrame's index (axis=0) or the columns (axis=1).
    Return type depends on whether passed function aggregates, or the
    reduce argument if the DataFrame is empty.

    Parameters
    ----------
    func : function
        Function to apply to each column/row
    axis : {0 or 'index', 1 or 'columns'}, default 0
        * 0 or 'index': apply function to each column
        * 1 or 'columns': apply function to each row
    broadcast : boolean, default False
        For aggregation functions, return object of same size with values
        propagated
    raw : boolean, default False
        If False, convert each row or column into a Series. If raw=True the
        passed function will receive ndarray objects instead. If you are
        just applying a NumPy reduction function this will achieve much
        better performance
    reduce : boolean or None, default None
        Try to apply reduction procedures. If the DataFrame is empty,
        apply will use reduce to determine whether the result should be a
        Series or a DataFrame. If reduce is None (the default), apply's
        return value will be guessed by calling func an empty Series (note:
        while guessing, exceptions raised by func will be ignored). If
        reduce is True a Series will always be returned, and if False a
        DataFrame will always be returned.
    args : tuple
        Positional arguments to pass to function in addition to the
        array/series
    Additional keyword arguments will be passed as keywords to the function

    Notes
    -----
    In the current implementation apply calls func twice on the
    first column/row to decide whether it can take a fast or slow
    code path. This can lead to unexpected behavior if func has
    side-effects, as they will take effect twice for the first
    column/row.

    Examples
    --------
    >>> df.apply(numpy.sqrt) # returns DataFrame
    >>> df.apply(numpy.sum, axis=0) # equiv to df.sum(0)
    >>> df.apply(numpy.sum, axis=1) # equiv to df.sum(1)

    See also
    --------
    DataFrame.applymap: For elementwise operations
    DataFrame.aggregate: only perform aggregating type operations
    DataFrame.transform: only perform transformating type operations

    Returns
    -------
    applied : Series or DataFrame

In [38]:
frame = pd.DataFrame(np.random.randn(4, 3),
                     index = ['Utah', 'Ohio', 'Texas', 'Oregon'],
                     columns = list('cda'))
frame.sort_index()

               c         d         a
Ohio   -0.187540  0.348444  0.177082
Oregon  1.809312 -1.383115 -1.832934
Texas   1.011814  0.491018 -0.082572
Utah   -0.381336 -2.266129 -0.264926

In [39]:
frame.sort_index(axis=1)

               a         c         d
Utah   -0.264926 -0.381336 -2.266129
Ohio    0.177082 -0.187540  0.348444
Texas  -0.082572  1.011814  0.491018
Oregon -1.832934  1.809312 -1.383115

In [40]:
frame.sort_index(axis=1, ascending=False)

               d         c         a
Utah   -2.266129 -0.381336 -0.264926
Ohio    0.348444 -0.187540  0.177082
Texas   0.491018  1.011814 -0.082572
Oregon -1.383115  1.809312 -1.832934

### Summarizing and Computing Descriptive Statistics

In [41]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])

print(df)

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [42]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [43]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [44]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [45]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [46]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [47]:
# On non-numeric data,
# describe() produces alternate summary statistics
s = pd.Series(['a', 'a', 'b', 'c'] * 4)
s.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Google/Yahoo/MorningStar Finance

You definitely want to check it out.
https://pandas-datareader.readthedocs.io/en/latest/

In [48]:
import pandas_datareader.data as web #  pip install pandas-datareader
import datetime

In [49]:
start = datetime.datetime(2017, 4, 1)
end = datetime.datetime(2018, 4, 13)
f = web.DataReader("F", 'morningstar', start, end)

In [50]:
print(type(f)) # like in heaven
print(f.head())

<class 'pandas.core.frame.DataFrame'>
                   Close    High    Low   Open    Volume
Symbol Date
F      2017-04-03  11.44  11.640  11.28  11.64  65664063
       2017-04-04  11.37  11.480  11.28  11.38  40059333
       2017-04-05  11.26  11.495  11.25  11.48  43296500
       2017-04-06  11.27  11.360  11.22  11.27  36163887
       2017-04-07  11.23  11.310  11.21  11.26  28873709

### Correlation and Covariance

In [51]:
# I want to know the replationship between several companies, ['AAPL', 'IBM', 'MSFT', 'GOOG'].
companies = ['AAPL', 'IBM', 'MSFT', 'GOOG']

# I need a 2D table, so using DataFrame and dictionary might be a good idea.
# {'AAPL': [value1, v2, v3, ...], 'IBM': [v1, v2, v3, ...], ...}
stock_data_dict = dict()

In [52]:
# Take a look at the API, help(web) or help(pandas_datareader.data)

# collect all data first
for com in companies:
    stock_data_dict[com] = web.get_data_morningstar(com, start, end)

for key in stock_data_dict:
    print(key, type(stock_data_dict[key]))

AAPL <class 'pandas.core.frame.DataFrame'>
IBM <class 'pandas.core.frame.DataFrame'>
MSFT <class 'pandas.core.frame.DataFrame'>
GOOG <class 'pandas.core.frame.DataFrame'>

In [53]:
# Two DataFrames. Select interesting columns, i.e., 'Volume' and 'Close'.
close = pd.DataFrame({k: stock_data_dict[k]["Close"].tolist() for k in stock_data_dict})
volume = pd.DataFrame({k: stock_data_dict[k]["Volume"].tolist() for k in stock_data_dict})

In [54]:
print(close.head())

     AAPL    GOOG     IBM   MSFT
0  143.70  838.55  174.50  65.55
1  144.77  834.57  174.52  65.73
2  144.02  831.41  172.88  65.56
3  143.66  827.88  172.45  65.73
4  143.34  824.67  172.14  65.68

In [55]:
print(volume.head())

       AAPL     GOOG      IBM      MSFT
0  19985714  1671503  4286498  20400871
1  19891354  1045363  3108870  12997449
2  27717854  1555328  6238854  21448594
3  21149034  1254433  3435363  18103453
4  16672198  1057253  3588302  14108533

In [56]:
"""
Series.pct_change(periods=1, fill_method='pad', limit=None, freq=None)
Percent change over given number of periods.
"""

ptcClose = close.pct_change()
ptcClose.tail()

         AAPL      GOOG       IBM      MSFT
265  0.009918  0.008351  0.014080  0.005985
266  0.018818  0.015944  0.017683  0.023246
267 -0.004675 -0.011312 -0.000193 -0.010982
268  0.009859  0.012294  0.017443  0.018724
269  0.003388 -0.003138 -0.008604 -0.005343

In [57]:
# Find the relation between IBM and MSFT
# Do they have 'similar' ptc?

print(ptcClose.AAPL.corr(ptcClose.IBM))
print(pd.Series.corr(ptcClose.AAPL, ptcClose.IBM))

0.256318682919
0.256318682919

In [58]:
print(ptcClose.AAPL.cov(ptcClose.IBM))

3.96100632939e-05

In [59]:
# DataFrame's version returns all
ptcClose.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.647110  0.256319  0.659930
GOOG  0.647110  1.000000  0.380578  0.780112
IBM   0.256319  0.380578  1.000000  0.405764
MSFT  0.659930  0.780112  0.405764  1.000000

In [60]:
ptcClose.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000165  0.000109  0.000040  0.000112
GOOG  0.000109  0.000171  0.000060  0.000135
IBM   0.000040  0.000060  0.000145  0.000065
MSFT  0.000112  0.000135  0.000065  0.000175

In [61]:
ptcClose.corrwith(ptcClose.IBM) # another way

AAPL    0.256319
GOOG    0.380578
IBM     1.000000
MSFT    0.405764
dtype: float64

In [62]:
# Passing a DataFrame computes the correlations of matching column names.
ptcClose.corrwith(volume)

AAPL   -0.087992
GOOG   -0.190664
IBM     0.048895
MSFT    0.039964
dtype: float64

### Count Data

In [63]:
df = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                'Qu2': [2, 3, 1, 2, 3],
                'Qu3': [1, 5, 2, 4, 4]})
print(df)

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [64]:
# I want to know how many 1s, 2s, ... in each column.
rdf = df.apply(pd.value_counts)
#rdf = rdf.fillna(0)
print(rdf)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

### Handling Missing Data

In [65]:
from numpy import nan as NaN

s_data = pd.Series(['aardvark', 'artichoke', NaN, 'avocado'])
s_data.isnull() # notnull()

0    False
1    False
2     True
3    False
dtype: bool

In [66]:
print(s_data.dropna())

0     aardvark
1    artichoke
3      avocado
dtype: object

In [67]:
print(s_data.fillna('N/A'))

0     aardvark
1    artichoke
2          N/A
3      avocado
dtype: object

In [68]:
# DataFrame version has reachful args.

import numpy.random
s = pd.Series(numpy.random.randn(21))
s[s < 0] = NaN
s = s.values.reshape(7,3)
df = pd.DataFrame(s)
print(df)

          0         1         2
0  0.356116  0.049020       NaN
1  0.502161  0.019889  0.861765
2       NaN       NaN  2.511699
3  0.721799  1.344760       NaN
4       NaN  0.134827       NaN
5       NaN  1.631289       NaN
6       NaN  0.137440       NaN

In [69]:
df = pd.DataFrame(numpy.random.randn(7,3))
df = df.apply(lambda s: [i if i > 0 else NaN for i in s])
df

          0         1         2
0  0.379280       NaN       NaN
1  0.629046       NaN  0.897093
2       NaN  0.326581  0.931528
3  0.279905  0.644686       NaN
4       NaN  0.721456       NaN
5       NaN  0.014427       NaN
6       NaN       NaN  0.048310

In [70]:
df.fillna({0: -0.5, 1: -1}) # try fillna(0, inplace=True)

          0         1         2
0  0.379280 -1.000000       NaN
1  0.629046 -1.000000  0.897093
2 -0.500000  0.326581  0.931528
3  0.279905  0.644686       NaN
4 -0.500000  0.721456       NaN
5 -0.500000  0.014427       NaN
6 -0.500000 -1.000000  0.048310

In [71]:
df.fillna(method='ffill') # method : {'backfill', 'bfill', 'pad', 'ffill', None}

          0         1         2
0  0.379280       NaN       NaN
1  0.629046       NaN  0.897093
2  0.629046  0.326581  0.931528
3  0.279905  0.644686  0.931528
4  0.279905  0.721456  0.931528
5  0.279905  0.014427  0.931528
6  0.279905  0.014427  0.048310

In [72]:
print(df.mean())
print(df.fillna(df.mean()))

0    0.429410
1    0.426788
2    0.625644
dtype: float64
          0         1         2
0  0.379280  0.426788  0.625644
1  0.629046  0.426788  0.897093
2  0.429410  0.326581  0.931528
3  0.279905  0.644686  0.625644
4  0.429410  0.721456  0.625644
5  0.429410  0.014427  0.625644
6  0.429410  0.426788  0.048310

### High Dimensional Indexing, Hierarchical Indexing

In [73]:
import numpy.random

data = pd.Series(numpy.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
print(data)
print(data.index)

a  1    0.355535
   2   -0.692143
   3   -0.085237
b  1   -1.134957
   2    0.058373
   3    0.721440
c  1    0.815361
   2   -0.281240
d  2    0.839231
   3   -1.834121
dtype: float64
MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [74]:
data['b'] # Note that data is a Series

1   -1.134957
2    0.058373
3    0.721440
dtype: float64

In [75]:
data['b':'c']

b  1   -1.134957
   2    0.058373
   3    0.721440
c  1    0.815361
   2   -0.281240
dtype: float64

In [76]:
data[:, 2] # there is a ','

a   -0.692143
b    0.058373
c   -0.281240
d    0.839231
dtype: float64

In [77]:
# Since Series is conceptually 1D,
# we can unstack() it to DataFrame
# Question: what is the differenc bewteen multi-indexed 1D data and 2D data?

data.unstack()

          1         2         3
a  0.355535 -0.692143 -0.085237
b -1.134957  0.058373  0.721440
c  0.815361 -0.281240       NaN
d       NaN  0.839231 -1.834121

In [78]:
data.unstack().stack() # NaN will be ignored.

a  1    0.355535
   2   -0.692143
   3   -0.085237
b  1   -1.134957
   2    0.058373
   3    0.721440
c  1    0.815361
   2   -0.281240
d  2    0.839231
   3   -1.834121
dtype: float64

In [79]:
import numpy

frame = pd.DataFrame(numpy.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [80]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [81]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [82]:
frame.sortlevel(1) # start from 0, try 1

C:\Users\hsiao\Miniconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  if __name__ == '__main__':

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [83]:
"""
Note: usually, you swaplevel(1).sortlevel(1).
Data selection performance is much better on hierarchically indexed objects
if the index is lexicographically sorted starting with the outermost level.
"""

'\nNote: usually, you swaplevel(1).sortlevel(1).\nData selection performance is much better on hierarchically indexed objects\nif the index is lexicographically sorted starting with the outermost level.\n'

In [84]:
frame.sum()

state     color
Ohio      Green    18
          Red      22
Colorado  Green    26
dtype: int64

In [85]:
frame.sum(level='key2') # keep the level structure of 'key2'

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [86]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Move column to index

In [87]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [88]:
frame.set_index(['c','d'], drop=True) # Try drop=False

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [89]:
frame.reset_index() # move the hierarchical index levels to column

   index  a  b    c  d
0      0  0  7  one  0
1      1  1  6  one  1
2      2  2  5  one  2
3      3  3  4  two  0
4      4  4  3  two  1
5      5  5  2  two  2
6      6  6  1  two  3

### pandas's Panel Data
Question: do we truly need N-dimensional arrays?
Panel is 3d.

In [90]:
import pandas_datareader.data as web
import datetime

companies = ['AAPL', 'IBM', 'MSFT', 'GOOG']
start = datetime.datetime(2018, 1, 1)
end = datetime.datetime(2018, 4, 13)

In [91]:
stock_data_dict = dict()
for com in companies:
    stock_data_dict[com] = web.get_data_morningstar(com, start, end)

In [92]:
pdata = pd.Panel(
    dict(
        (stk, web.get_data_morningstar(stk, start, end)) for stk in companies
    )
)

In [93]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 300 (major_axis) x 5 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: (AAPL, 2018-01-01 00:00:00) to (MSFT, 2018-04-13 00:00:00)
Minor_axis axis: Close to Volume